import { IFAQ } from "@/types";

export const faqs: IFAQ[] = [
    {
        question: `1. ใช้เวลาในการซ่อมนานแค่ไหน?`,
        answer: 'ตอบ: เวลาซ่อมขึ้นอยู่กับประเภทของงาน เช่นเปลี่ยนแบตเตอรี่: 30-60 นาทีเปลี่ยนหน้าจอ: 1-2 ชั่วโมงงานเมนบอร์ดหรือน้ำเข้า: 1-3 วัน (ขึ้นกับอาการ)',
    },
    {
        question: `2. อะไหล่ที่ใช้เป็นของแท้หรือไม่?`,
        answer: 'ตอบ: เราใช้อะไหล่คุณภาพสูงระดับพรีเมียม ทั้งแท้ศูนย์และเทียบเท่า (OEM) โดยจะแจ้งลูกค้าให้ทราบก่อนทุกครั้ง',
    },
    {
        question: '3. มีการรับประกันงานซ่อมหรือไม่?',
        answer: `ตอบ: มีครับ งานซ่อมทั่วไปเช่น เปลี่ยนจอ, เปลี่ยนแบต รับประกัน 30-90 วัน ขึ้นกับประเภทงาน และเงื่อนไขการใช้งาน`
    },
    {
        question: '4. ถ้าอยู่ต่างจังหวัดสามารถส่งซ่อมได้ไหม?',
        answer: 'ตอบ:ได้ครับ! ลูกค้าสามารถจัดส่งเครื่องมาทางไปรษณีย์หรือขนส่งเอกชนได้ เรามีบริการจัดส่งกลับถึงบ้านแบบมีประกันพัสดุ',
    },
    {
        question: '5. ตรวจเช็คอาการเบื้องต้นมีค่าใช้จ่ายหรือไม่?',
        answer: 'ตอบ: ไม่มีค่าใช้จ่าย เราตรวจเช็คฟรี และจะแจ้งราคาก่อนซ่อมทุกครั้ง ไม่มีบวกเพิ่มภายหลังแน่นอน'
    }
];